// ============================================================
//  КАЛЕНДАРЬ НЕДЕЛЬ
// ============================================================
const WEEKS = [
  "01.09.2026 | 06.09.2026 | *",
  "07.09.2026 | 13.09.2026 | **",
  "14.09.2026 | 20.09.2026 | *",
  "21.09.2026 | 27.09.2026 | **",
  "28.09.2026 | 04.09.2026 | *",
  "05.10.2026 | 11.10.2026 | **",
  "12.10.2026 | 18.10.2026 | *",
  "19.10.2026 | 25.10.2026 | **",
  "26.10.2026 | 01.11.2026 | *",
  "02.11.2026 | 08.11.2026 | **",
  "09.11.2026 | 15.11.2026 | *",
  "16.11.2026 | 22.11.2026 | **",
  "23.11.2026 | 29.11.2026 | *",
  "30.11.2026 | 06.12.2026 | **",
  "07.12.2026 | 13.12.2026 | *",
  "14.12.2026 | 20.12.2026 | **",
  "21.12.2026 | 27.12.2026 | *",
  "28.12.2026 | 10.01.2027 | **",
  "11.01.2027 | 17.01.2027 | *",
  "18.01.2027 | 24.01.2027 | **",
  "25.01.2027 | 31.01.2027 | *",
  "01.02.2027 | 07.01.2027 | **",
  "08.02.2027 | 14.02.2027 | *",
  "15.02.2027 | 21.02.2027 | **",
  "22.02.2027 | 28.02.2027 | *",
  "01.03.2027 | 07.03.2027 | **",
  "08.03.2027 | 14.03.2027 | *",
  "15.03.2027 | 21.03.2027 | **",
  "22.03.2027 | 28.03.2027 | *",
  "29.03.2027 | 04.04.2027 | **",
  "05.04.2027 | 11.04.2027 | *",
  "12.04.2027 | 18.04.2027 | **",
  "19.04.2027 | 25.04.2027 | *",
  "26.04.2027 | 02.05.2027 | **",
  "03.05.2027 | 09.05.2027 | *",
  "10.05.2027 | 16.05.2027 | **",
  "17.05.2027 | 23.05.2027 | *",
  "24.05.2027 | 30.05.2027 | **",
  "31.05.2027 | 06.06.2027 | *",
  "07.06.2027 | 13.06.2027 | **",
  "14.06.2027 | 20.06.2027 | *",
];

// ============================================================
//  ЦВЕТА СПЕЦИАЛЬНОСТЕЙ
// ============================================================
const COLORS = {
  "ЗСП":  { c: "#6ecf9b", soft: "#f4fbf7", text: "#2f9c66" },
  "ЭСП":  { c: "#e6b86a", soft: "#fdf9f1", text: "#b8862f" },
  // РУПО сделаем светло-голубым (небесным), а ИСП оставим тёмно-синим
  "РУПО": { c: "#4C9AFF", soft: "#EDF5FF", text: "#2b6fbb" }, 
  "ИСП":  { c: "#1769E0", soft: "#E8F1FF", text: "#1769E0" },
  "ЮСП":  { c: "#e86a6a", soft: "#fdf5f5", text: "#c43a3a" },
  "teacher": { c: "#e6b86a", soft: "#fdf9f1", text: "#b8862f" }
};

// ============================================================
//  КАРТА: ГРУППА → КУРС
// ============================================================
const GROUP_TO_COURSE = {
  // 1 курс
  "РУПО-261": "1", "РУПО-262": "1", "РУПО-263": "1", "РУПО-264": "1",
  "ЗСП-261":  "1", "ЗСП-262":  "1",
  "ЮСП-261":  "1", "ЮСП-262":  "1",
  "ЭСП-261":  "1",

  // 2 курс
  "ИСП-251":  "2", "ИСП-252":  "2", "ИСП-253":  "2", "ИСП-254":  "2",
  "РУПО-265": "2",
  "ЗСП-251":  "2", "ЗСП-252":  "2",
  "ЮСП-251":  "2", "ЮСП-252":  "2", "ЮСП-263":  "2",
  "ЭСП-251":  "2",

  // 3 курс
  "ИСП-241":  "3", "ИСП-242":  "3", "ИСП-243":  "3",
  "ЗСП-241":  "3",
  "ЮСП-241":  "3", "ЮСП-242":  "3", "ЮСП-253":  "3",

  // 4 курс
  "ИСП-231":  "4", "ИСП-232":  "4", "ИСП-233":  "4",
  "ЗСП-231":  "4",
  "ЭСП-241":  "4"
};

// ============================================================
//  ДАННЫЕ
// ============================================================
const RAW_DATA = {
  "РУПО-261": {
    "0": [
      { "number": 1, "text": "Математика (л.) преп. Трошина О.В., ауд. 3-27" },
      { "number": 2, "text": "История (пр.) преп. Мясникова О.Н., ауд. 2-33", "star": "*" },
      { "number": 2, "text": "География (пр.) преп. Доронин М.С., ауд. 3-30", "star": "**" },
      { "number": 3, "text": "История (л.) преп. Мясникова О.Н., ауд. 2-20" },
      { "number": 4, "text": "Кураторский час преп. Трошина О.В., ауд. 2-13", "star": "*" },
      { "number": 4, "text": "Физическая культура (пр.) преп. Магомедов С.К., спортивный зал", "star": "**" }
    ],
    "1": [
      { "number": 1, "text": "Химия (л.) преп. Карпова Н.Н., ауд. 2-20" },
      { "number": 2, "text": "Математика (пр.) преп. Трошина О.В., ауд. 2-13" },
      { "number": 3, "text": "География (л.) преп. Доронин М.С., ауд. 2-20" },
      { "number": 4, "text": "Русский язык (л.) преп. Саблина Е.Е., ауд. 2-20", "star": "*" },
      { "number": 4, "text": "Литература (л.) преп. Чистоткина Е.С., ауд. 2-20", "star": "**" }
    ],
    "2": [
      { "number": 2, "text": "Информатика (пр.) преп. Трошина О.В., ауд. 1-36" },
      { "number": 3, "text": "Русский язык (пр.) преп. Саблина Е.Е., ауд. 3-15" }
    ],
    "3": [
      { "number": 1, "text": "Математика (пр.) преп. Трошина О.В., ауд. 2-13" },
      { "number": 2, "text": "Химия (пр.) преп. Карпова Н.Н., ауд. 3-30", "star": "*" },
      { "number": 2, "text": "Литература (пр.) преп. Чистоткина Е.С., ауд. 3-15", "star": "**" },
      { "number": 3, "text": "Иностранный язык (пр.) преп. Пенькова О.В., ауд. 2-22" }
    ],
    "4": [
      { "number": 1, "text": "Математика (л.) преп. Трошина О.В., ауд. 3-27" }
    ],
    "5": [
      { "number": 2, "text": "Физика (пр.) преп. Ушакова М.А., ауд. 3-29", "star": "*" },
      { "number": 3, "text": "Физика (л.) преп. Ушакова М.А., ауд. 2-20", "star": "*" },
      { "number": 3, "text": "Индивидуальный проект (пр.) 26.09.2026, 24.10.2026, 21.11.2026 преп. Юханаева Е.В., ауд. 2-20", "star": "**", "dates": ["2026-09-26", "2026-10-24", "2026-11-21"] }
    ]
  },

  "РУПО-262": {
    "0": [
      { "number": 1, "text": "Математика (л.) преп. Лосева Н.В., ауд. Актовый зал" },
      { "number": 2, "text": "География (пр.) преп. Доронин М.С., ауд. 3-30", "star": "*" },
      { "number": 2, "text": "История (пр.) преп. Мясникова О.Н., ауд. 2-33", "star": "**" },
      { "number": 3, "text": "История (л.) преп. Мясникова О.Н., ауд. 2-20" }
    ],
    "1": [
      { "number": 1, "text": "Химия (л.) преп. Карпова Н.Н., ауд. 2-20" },
      { "number": 2, "text": "Математика (пр.) преп. Попова Н.Е., ауд. 2-14" },
      { "number": 3, "text": "География (л.) преп. Доронин М.С., ауд. 2-20" },
      { "number": 4, "text": "Русский язык (л.) преп. Саблина Е.Е., ауд. 2-20", "star": "*" },
      { "number": 4, "text": "Литература (л.) преп. Чистоткина Е.С., ауд. 2-20", "star": "**" }
    ],
    "2": [
      { "number": 3, "text": "Информатика (пр.) преп. Попова Н.Е., ауд. 1-36" },
      { "number": 4, "text": "Информатика (пр.) преп. Попова Н.Е., ауд. 1-36" },
      { "number": 5, "text": "Кураторский час преп. Лобикова Е.С., ауд. 2-14", "star": "*" },
      { "number": 5, "text": "Физическая культура (пр.) преп. Магомедов С.К., спортивный зал", "star": "**" }
    ],
    "3": [
      { "number": 1, "text": "Математика (пр.) преп. Попова Н.Е., ауд. Актовый зал" },
      { "number": 2, "text": "Литература (пр.) преп. Чистоткина Е.С., ауд. 3-15", "star": "*" },
      { "number": 2, "text": "Химия (пр.) преп. Бондарук Е.А., ауд. 3-30", "star": "**" },
      { "number": 3, "text": "Русский язык (пр.) преп. Саблина Е.Е., ауд. 2-14" },
      { "number": 4, "text": "Иностранный язык (пр.) преп. Пенькова О.В., ауд. 2-22" }
    ],
    "4": [
      { "number": 1, "text": "Математика (л.) преп. Лосева Н.В., ауд. Актовый зал" }
    ],
    "5": [
      { "number": 3, "text": "Физика (л.) преп. Ушакова М.А., ауд. 2-20", "star": "*" },
      { "number": 3, "text": "Индивидуальный проект (пр.) 26.09.2026, 24.10.2026, 21.11.2026 преп. Юханаева Е.В., ауд. 2-20", "star": "**", "dates": ["2026-09-26", "2026-10-24", "2026-11-21"] },
      { "number": 4, "text": "Физика (пр.) преп. Ушакова М.А., ауд. 3-29", "star": "*" }
    ]
  },

  "РУПО-263": {
    "0": [
      { "number": 1, "text": "Математика (л.) преп. Трошина О.В., ауд. 3-27" },
      { "number": 2, "text": "Русский язык (пр.) преп. Саблина Е.Е., ауд. 2-14" },
      { "number": 3, "text": "История (л.) преп. Мясникова О.Н., ауд. 2-20" },
      { "number": 4, "text": "История (пр.) преп. Мясникова О.Н., ауд. 3-20", "star": "*" },
      { "number": 4, "text": "Кураторский час преп. Попова Н.Е., ауд. 3-09", "star": "**" }
    ],
    "1": [
      { "number": 1, "text": "Химия (л.) преп. Карпова Н.Н., ауд. 2-20" },
      { "number": 2, "text": "Физическая культура (пр.) преп. Магомедов С.К., спортивный зал", "star": "*" },
      { "number": 2, "text": "География (пр.) преп. Доронин М.С., ауд. 3-15", "star": "**" },
      { "number": 3, "text": "География (л.) преп. Доронин М.С., ауд. 2-20" },
      { "number": 4, "text": "Русский язык (л.) преп. Саблина Е.Е., ауд. 2-20", "star": "*" },
      { "number": 4, "text": "Литература (л.) преп. Чистоткина Е.С., ауд. 2-20", "star": "**" }
    ],
    "2": [
      { "number": 1, "text": "Информатика (пр.) преп. Донскова Д.А., ауд. 3-09" },
      { "number": 2, "text": "Информатика (пр.) преп. Донскова Д.А., ауд. 3-09" },
      { "number": 3, "text": "Иностранный язык (пр.) преп. Пенькова О.В., ауд. 2-22" },
      { "number": 4, "text": "Литература (пр.) преп. Чистоткина Е.С., ауд. 3-29", "star": "*" },
      { "number": 4, "text": "Физика (пр.) преп. Ушакова М.А., ауд. 3-29", "star": "**" }
    ],
    "3": [
      { "number": 1, "text": "Математика (пр.) преп. Донскова Д.А., ауд. 3-30" },
      { "number": 2, "text": "Математика (пр.) преп. Донскова Д.А., ауд. 2-14" }
    ],
    "4": [
      { "number": 1, "text": "Математика (л.) преп. Трошина О.В., ауд. 3-27" }
    ],
    "5": [
      { "number": 2, "text": "Химия (пр.) преп. Бондарук Е.А., ауд. 3-18", "star": "*" },
      { "number": 3, "text": "Физика (л.) преп. Ушакова М.А., ауд. 2-20", "star": "*" },
      { "number": 3, "text": "Индивидуальный проект (пр.) 26.09.2026, 24.10.2026, 21.11.2026 преп. Юханаева Е.В., ауд. 2-20", "star": "**", "dates": ["2026-09-26", "2026-10-24", "2026-11-21"] }
    ]
  },

  "РУПО-264": {
    "0": [
      { "number": 1, "text": "Математика (л.) преп. Лосева Н.В., ауд. Актовый зал" },
      { "number": 2, "text": "Математика (пр.) преп. Кизатова Н.А., ауд. 3-29" },
      { "number": 3, "text": "История (л.) преп. Мясникова О.Н., ауд. 2-20" },
      { "number": 4, "text": "Физическая культура (пр.) преп. Магомедов С.К., спортивный зал", "star": "**" },
      { "number": 4, "text": "История (пр.) преп. Мясникова О.Н., ауд. 3-20", "star": "**" }
    ],
    "1": [
      { "number": 1, "text": "Химия (л.) преп. Карпова Н.Н., ауд. 2-20" },
      { "number": 2, "text": "География (пр.) преп. Доронин М.С., ауд. 3-15", "star": "*" },
      { "number": 2, "text": "Литература (пр.) преп. Чистоткина Е.С., ауд. 3-20", "star": "**" },
      { "number": 3, "text": "География (л.) преп. Доронин М.С., ауд. 2-20" },
      { "number": 4, "text": "Русский язык (л.) преп. Саблина Е.Е., ауд. 2-20", "star": "*" },
      { "number": 4, "text": "Литература (л.) преп. Чистоткина Е.С., ауд. 2-20", "star": "**" }
    ],
    "2": [
      { "number": 1, "text": "** Физика (пр.) преп. Ушакова М.А., ауд. 2-13", "star": "**" },
      { "number": 2, "text": "Иностранный язык (пр.) преп. Пенькова О.В., ауд. 2-22" },
      { "number": 3, "text": "Информатика (пр.) преп. Кизатова Н.А., ауд. 3-09" },
      { "number": 4, "text": "Информатика (пр.) преп. Кизатова Н.А., ауд. 3-09" }
    ],
    "3": [
      { "number": 1, "text": "Русский язык (пр.) преп. Саблина Е.Е., ауд. 3-15" },
      { "number": 2, "text": "Математика (пр.) преп. Кизатова Н.А., ауд. 2-17" },
      { "number": 3, "text": "Кураторский час преп. Юханаева Е.В., ауд. 3-14", "star": "*" }
    ],
    "4": [
      { "number": 1, "text": "Математика (л.) преп. Лосева Н.В., ауд. Актовый зал" }
    ],
    "5": [
      { "number": 3, "text": "Физика (л.) преп. Ушакова М.А., ауд. 2-20", "star": "*" },
      { "number": 3, "text": "Индивидуальный проект (пр.) 26.09.2026, 24.10.2026, 21.11.2026 преп. Юханаева Е.В., ауд. 2-20", "star": "**", "dates": ["2026-09-26", "2026-10-24", "2026-11-21"] },
      { "number": 4, "text": "Химия (пр.) преп. Бондарук Е.А., ауд. 3-19", "star": "*" }
    ]
  },

  "ИСП-252": {
    "0": [
      { "number": 1, "text": "Кураторский час преп. Видинеева Т.Н., ауд. 2-33", "star": "*" },
      { "number": 2, "text": "Элементы высшей математики (пр.) преп. Лосева Н.В., ауд. 2-23" },
      { "number": 3, "text": "Элементы высшей математики (л.) преп. Лосева Н.В., ауд. Актовый зал" }
    ],
    "1": [
      { "number": 1, "text": "Элементы высшей математики (пр.) преп. Лосева Н.В., ауд. 2-23", "star": "**" },
      { "number": 2, "text": "Основы алгоритмизации и программирования (лаб.) преп. Леонтьев Д.А., ауд. 1-02" },
      { "number": 3, "text": "Психология общения (л.) преп. Перфильева Ю.Н., ауд. Актовый зал", "star": "*" },
      { "number": 3, "text": "Основы бережливого производства (л.) преп. Перфильева Ю.Н., ауд. Актовый зал", "star": "**" },
      { "number": 4, "text": "Психология общения (пр.) преп. Перфильева Ю.Н., ауд. 3-30", "star": "*" },
      { "number": 4, "text": "Основы бережливого производства (пр.) преп. Перфильева Ю.Н., ауд. 3-30", "star": "**" }
    ],
    "2": [
      { "number": 2, "text": "Операционные системы и среды (л.) преп. Попова Н.Е., ауд. 2-20", "star": "**" },
      { "number": 3, "text": "Основы проектирования баз данных (л.) преп. Юханаева Е.В., ауд. Актовый зал", "star": "*" },
      { "number": 3, "text": "Численные методы (л.) преп. Трошина О.В., ауд. Актовый зал", "star": "**" },
      { "number": 4, "text": "Архитектура аппаратных средств (л.) преп. Леонтьев Д.А., ауд. Актовый зал", "star": "*" },
      { "number": 4, "text": "Дискретная математика с элементами математической логики (л.) преп. Трошина О.В., ауд. Актовый зал", "star": "**" },
      { "number": 5, "text": "Основы проектирования баз данных (лаб.) преп. Юханаева Е.В., ауд. 3-12" }
    ],
    "3": [
      { "number": 1, "text": "Иностранный язык в профессиональной сфере (пр.) преп. Пенькова О.В., ауд. 2-22" },
      { "number": 2, "text": "Архитектура аппаратных средств (лаб.) преп. Леонтьев Д.А., ауд. 3-12", "star": "*" },
      { "number": 2, "text": "Операционные системы и среды (лаб.) преп. Попова Н.Е., ауд. 3-12", "star": "**" },
      { "number": 3, "text": "Дискретная математика с элементами математической логики (пр.) преп. Трошина О.В., ауд. 2-13" }
    ],
    "4": [
      { "number": 1, "text": "Численные методы (лаб.) преп. Трошина О.В., ауд. 3-03" }
    ]
  },

  "ИСП-251": {
    "0": [
      { "number": 2, "text": "Основы проектирования баз данных (лаб.) преп. Юханаева Е.В., ауд. 3-12" },
      { "number": 3, "text": "Элементы высшей математики (л.) преп. Лосева Н.В., ауд. Актовый зал" }
    ],
    "1": [
      { "number": 1, "text": "Основы алгоритмизации и программирования (лаб.) преп. Леонтьев Д.А., ауд. 1-36" },
      { "number": 2, "text": "Психология общения (пр.) преп. Перфильева Ю.Н., ауд. 3-30", "star": "*" },
      { "number": 2, "text": "Основы бережливого производства (пр.) преп. Перфильева Ю.Н., ауд. 3-30", "star": "**" },
      { "number": 3, "text": "Психология общения (л.) преп. Перфильева Ю.Н., ауд. Актовый зал", "star": "*" },
      { "number": 3, "text": "Основы бережливого производства (л.) преп. Перфильева Ю.Н., ауд. Актовый зал", "star": "**" },
      { "number": 4, "text": "Элементы высшей математики (пр.) преп. Лосева Н.В., ауд. 2-23" }
    ],
    "2": [
      { "number": 2, "text": "Операционные системы и среды (л.) преп. Попова Н.Е., ауд. 2-20", "star": "**" },
      { "number": 3, "text": "Основы проектирования баз данных (л.) преп. Юханаева Е.В., ауд. Актовый зал", "star": "*" },
      { "number": 3, "text": "Численные методы (л.) преп. Трошина О.В., ауд. Актовый зал", "star": "**" },
      { "number": 4, "text": "Архитектура аппаратных средств (л.) преп. Леонтьев Д.А., ауд. Актовый зал", "star": "*" },
      { "number": 4, "text": "Дискретная математика с элементами математической логики (л.) преп. Трошина О.В., ауд. Актовый зал", "star": "**" },
      { "number": 5, "text": "Операционные системы и среды (лаб.) преп. Попова Н.Е., ауд. 3-03", "star": "**" }
    ],
    "3": [
      { "number": 1, "text": "Элементы высшей математики (пр.) преп. Лосева Н.В., ауд. 2-23", "star": "**" },
      { "number": 2, "text": "Иностранный язык в профессиональной сфере (пр.) преп. Пенькова О.В., ауд. 2-22" },
      { "number": 3, "text": "Физическая культура (пр.) преп. Ерохина О.А., спортивный зал" },
      { "number": 4, "text": "Дискретная математика с элементами математической логики (пр.) преп. Трошина О.В., ауд. 2-13" },
      { "number": 5, "text": "Архитектура аппаратных средств (лаб.) преп. Леонтьев Д.А., ауд. 3-12", "star": "*" }
    ],
    "4": [
      { "number": 1, "text": "Основы алгоритмизации и программирования (лаб.) преп. Леонтьев Д.А., ауд. 1-02" },
      { "number": 2, "text": "Численные методы (лаб.) преп. Трошина О.В., ауд. 3-03" },
      { "number": 3, "text": "Кураторский час преп. Кизатова Н.А., ауд. 3-02", "star": "**" }
    ]
  },

  "ИСП-253": {
    "0": [
      { "number": 2, "text": "Кураторский час преп. Чистоткина Е.С., ауд. 3-20", "star": "*" },
      { "number": 3, "text": "Элементы высшей математики (л.) преп. Лосева Н.В., ауд. Актовый зал" },
      { "number": 4, "text": "Элементы высшей математики (пр.) преп. Кизатова Н.А., ауд. 3-29" }
    ],
    "1": [
      { "number": 1, "text": "Психология общения (пр.) преп. Перфильева Ю.Н., ауд. 3-30", "star": "*" },
      { "number": 1, "text": "Основы бережливого производства (пр.) преп. Перфильева Ю.Н., ауд. 3-30", "star": "**" },
      { "number": 2, "text": "Иностранный язык в профессиональной сфере (пр.) преп. Пенькова О.В., ауд. 2-22" },
      { "number": 3, "text": "Психология общения (л.) преп. Перфильева Ю.Н., ауд. Актовый зал", "star": "*" },
      { "number": 3, "text": "Основы бережливого производства (л.) преп. Перфильева Ю.Н., ауд. Актовый зал", "star": "**" },
      { "number": 4, "text": "Основы алгоритмизации и программирования (лаб.) преп. Леонтьев Д.А., ауд. 1-02" }
    ],
    "2": [
      { "number": 2, "text": "Операционные системы и среды (л.) преп. Попова Н.Е., ауд. 2-20", "star": "**" },
      { "number": 3, "text": "Основы проектирования баз данных (л.) преп. Юханаева Е.В., ауд. Актовый зал", "star": "*" },
      { "number": 3, "text": "Численные методы (л.) преп. Трошина О.В., ауд. Актовый зал", "star": "**" },
      { "number": 4, "text": "Архитектура аппаратных средств (л.) преп. Леонтьев Д.А., ауд. Актовый зал", "star": "*" },
      { "number": 4, "text": "Дискретная математика с элементами математической логики (л.) преп. Трошина О.В., ауд. Актовый зал", "star": "**" }
    ],
    "3": [
      { "number": 1, "text": "Физическая культура (пр.) преп. Ерохина О.А., спортивный зал" },
      { "number": 2, "text": "Дискретная математика с элементами математической логики (пр.) преп. Трошина О.В., ауд. 2-13" },
      { "number": 3, "text": "Архитектура аппаратных средств (лаб.) преп. Леонтьев Д.А., ауд. 3-12", "star": "*" },
      { "number": 4, "text": "Элементы высшей математики (пр.) преп. Кизатова Н.А., ауд. 3-29", "star": "*" }
    ],
    "4": [
      { "number": 2, "text": "Операционные системы и среды (лаб.) преп. Попова Н.Е., ауд. 1-02", "star": "**" },
      { "number": 3, "text": "Основы алгоритмизации и программирования (лаб.) преп. Леонтьев Д.А., ауд. 1-02" },
      { "number": 4, "text": "Численные методы (лаб.) преп. Трошина О.В., ауд. 3-09" },
      { "number": 5, "text": "Основы проектирования баз данных (лаб.) преп. Юханаева Е.В., ауд. 3-03" }
    ]
  },

  "РУПО-265": {
    "0": [
      { "number": 2, "text": "Кураторский час преп. Чистоткина Е.С., ауд. 3-20", "star": "*" },
      { "number": 3, "text": "Элементы высшей математики (л.) преп. Лосева Н.В., ауд. Актовый зал" },
      { "number": 4, "text": "Элементы высшей математики (пр.) преп. Кизатова Н.А., ауд. 3-29" }
    ],
    "1": [
      { "number": 1, "text": "Психология общения (пр.) преп. Перфильева Ю.Н., ауд. 3-30", "star": "*" },
      { "number": 1, "text": "Основы бережливого производства (пр.) преп. Перфильева Ю.Н., ауд. 3-30", "star": "**" },
      { "number": 2, "text": "Иностранный язык в профессиональной сфере (пр.) преп. Пенькова О.В., ауд. 2-22" },
      { "number": 3, "text": "Психология общения (л.) преп. Перфильева Ю.Н., ауд. Актовый зал", "star": "*" },
      { "number": 3, "text": "Основы бережливого производства (л.) преп. Перфильева Ю.Н., ауд. Актовый зал", "star": "**" },
      { "number": 4, "text": "Основы алгоритмизации и программирования (лаб.) преп. Леонтьев Д.А., ауд. 1-02" }
    ],
    "2": [
      { "number": 2, "text": "Операционные системы и среды (л.) преп. Попова Н.Е., ауд. 2-20", "star": "**" },
      { "number": 3, "text": "Основы проектирования баз данных (л.) преп. Юханаева Е.В., ауд. Актовый зал", "star": "*" },
      { "number": 3, "text": "Численные методы (л.) преп. Трошина О.В., ауд. Актовый зал", "star": "**" },
      { "number": 4, "text": "Архитектура аппаратных средств (л.) преп. Леонтьев Д.А., ауд. Актовый зал", "star": "*" },
      { "number": 4, "text": "Дискретная математика с элементами математической логики (л.) преп. Трошина О.В., ауд. Актовый зал", "star": "**" }
    ],
    "3": [
      { "number": 1, "text": "Физическая культура (пр.) преп. Ерохина О.А., спортивный зал" },
      { "number": 2, "text": "Дискретная математика с элементами математической логики (пр.) преп. Трошина О.В., ауд. 2-13" },
      { "number": 3, "text": "Архитектура аппаратных средств (лаб.) преп. Леонтьев Д.А., ауд. 3-12", "star": "*" },
      { "number": 4, "text": "Элементы высшей математики (пр.) преп. Кизатова Н.А., ауд. 3-29", "star": "*" }
    ],
    "4": [
      { "number": 2, "text": "Операционные системы и среды (лаб.) преп. Попова Н.Е., ауд. 1-02", "star": "**" },
      { "number": 3, "text": "Основы алгоритмизации и программирования (лаб.) преп. Леонтьев Д.А., ауд. 1-02" },
      { "number": 4, "text": "Численные методы (лаб.) преп. Трошина О.В., ауд. 3-09" },
      { "number": 5, "text": "Основы проектирования баз данных (лаб.) преп. Юханаева Е.В., ауд. 3-03" }
    ]
  },

  "ИСП-254": {
    "0": [
      { "number": 2, "text": "Кураторский час преп. Чистоткина Е.С., ауд. 3-20", "star": "*" },
      { "number": 3, "text": "Элементы высшей математики (л.) преп. Лосева Н.В., ауд. Актовый зал" },
      { "number": 4, "text": "Элементы высшей математики (пр.) преп. Кизатова Н.А., ауд. 3-29" }
    ],
    "1": [
      { "number": 1, "text": "Психология общения (пр.) преп. Перфильева Ю.Н., ауд. 3-30", "star": "*" },
      { "number": 1, "text": "Основы бережливого производства (пр.) преп. Перфильева Ю.Н., ауд. 3-30", "star": "**" },
      { "number": 2, "text": "Иностранный язык в профессиональной сфере (пр.) преп. Пенькова О.В., ауд. 2-22" },
      { "number": 3, "text": "Психология общения (л.) преп. Перфильева Ю.Н., ауд. Актовый зал", "star": "*" },
      { "number": 3, "text": "Основы бережливого производства (л.) преп. Перфильева Ю.Н., ауд. Актовый зал", "star": "**" },
      { "number": 4, "text": "Основы алгоритмизации и программирования (лаб.) преп. Леонтьев Д.А., ауд. 1-02" }
    ],
    "2": [
      { "number": 2, "text": "Операционные системы и среды (л.) преп. Попова Н.Е., ауд. 2-20", "star": "**" },
      { "number": 3, "text": "Основы проектирования баз данных (л.) преп. Юханаева Е.В., ауд. Актовый зал", "star": "*" },
      { "number": 3, "text": "Численные методы (л.) преп. Трошина О.В., ауд. Актовый зал", "star": "**" },
      { "number": 4, "text": "Архитектура аппаратных средств (л.) преп. Леонтьев Д.А., ауд. Актовый зал", "star": "*" },
      { "number": 4, "text": "Дискретная математика с элементами математической логики (л.) преп. Трошина О.В., ауд. Актовый зал", "star": "**" },
      { "number": 5, "text": "Основы проектирования баз данных (лаб.) преп. Юханаева Е.В., ауд. 3-12" }
    ],
    "3": [
      { "number": 1, "text": "Иностранный язык в профессиональной сфере (пр.) преп. Пенькова О.В., ауд. 2-22" },
      { "number": 2, "text": "Архитектура аппаратных средств (лаб.) преп. Леонтьев Д.А., ауд. 3-12", "star": "*" },
      { "number": 2, "text": "Операционные системы и среды (лаб.) преп. Попова Н.Е., ауд. 3-12", "star": "**" },
      { "number": 3, "text": "Дискретная математика с элементами математической логики (пр.) преп. Трошина О.В., ауд. 2-13" },
      { "number": 3, "text": "Архитектура аппаратных средств (лаб.) преп. Попова Н.Е., ауд. 3-09", "star": "*" },
      { "number": 3, "text": "Операционные системы и среды (лаб.) преп. Попова Н.Е., ауд. 3-12", "star": "**" }
    ],
    "4": [
      { "number": 1, "text": "Численные методы (лаб.) преп. Трошина О.В., ауд. 3-03" },
      { "number": 1, "text": "Основы алгоритмизации и программирования (лаб.) преп. Донскова Д.А., ауд. 1-36" },
      { "number": 2, "text": "Основы алгоритмизации и программирования (лаб.) преп. Донскова Д.А., ауд. 3-09" },
      { "number": 3, "text": "Численные методы (лаб.) преп. Трошина О.В., ауд. 3-09" },
      { "number": 4, "text": "Основы проектирования баз данных (лаб.) преп. Юханаева Е.В., ауд. 3-12" }
    ]
  },

  "ИСП-231": {
    "0": [
      { "number": 1, "text": "Основы философии (пр.) преп. Громова Е.А., ауд. 3-18" },
      { "number": 2, "text": "Иностранный язык в профессиональной сфере (пр.) преп. Пенькова О.В., ауд. 2-22" }
    ],
    "1": [
      { "number": 1, "text": "Разработка и эксплуатация экономических информационных систем (л.) преп. Попова Н.Е., ауд. Актовый зал", "star": "*" },
      { "number": 1, "text": "Физическая культура (пр.) преп. Магомедов С.К., спортивный зал", "star": "**" },
      { "number": 2, "text": "Технология разработки и защиты баз данных (л.) преп. Донскова Д.А., ауд. Актовый зал" },
      { "number": 3, "text": "Стандартизация, сертификация и техническое документирование (л.) преп. Сидорова С.А., ауд. 3-02" },
      { "number": 4, "text": "Разработка и эксплуатация экономических информационных систем (лаб.) преп. Попова Н.Е., ауд. 1-36", "star": "*" },
      { "number": 4, "text": "Кураторский час преп. Трошина О.В., ауд. 2-17", "star": "**" }
    ],
    "3": [
      { "number": 4, "text": "Поддержка и тестирование программных модулей (л.) преп. Юханаева Е.В., ауд. 3-02" },
      { "number": 5, "text": "Технология разработки и защиты баз данных (л.) преп. Донскова Д.А., ауд. Актовый зал" }
    ],
    "4": [
      { "number": 1, "text": "Основы философии (пр.) преп. Громова Е.А., ауд. 3-18" },
      { "number": 2, "text": "Стандартизация, сертификация и техническое документирование (пр.) преп. Сидорова С.А., ауд. 3-12" },
      { "number": 3, "text": "Поддержка и тестирование программных модулей (лаб.) преп. Юханаева Е.В., ауд. 3-03" },
      { "number": 4, "text": "Разработка и эксплуатация экономических информационных систем (л.) преп. Попова Н.Е., ауд. Актовый зал" },
      { "number": 5, "text": "Основы философии (л.) преп. Громова Е.А., ауд. Актовый зал" }
    ],
    "5": [
      { "number": 2, "text": "Разработка и эксплуатация экономических информационных систем (лаб.) преп. Попова Н.Е., ауд. 1-36" },
      { "number": 3, "text": "Технология разработки и защиты баз данных (лаб.) преп. Донскова Д.А., ауд. 1-02" },
      { "number": 4, "text": "Технология разработки и защиты баз данных (лаб.) преп. Донскова Д.А., ауд. 1-02" }
    ]
  },

  "ИСП-232": {
    "0": [
      { "number": 1, "text": "Кураторский час преп. Саблина Е.Е., ауд. 2-14", "star": "*" },
      { "number": 2, "text": "Основы философии (пр.) преп. Громова Е.А., ауд. 3-19" },
      { "number": 3, "text": "Иностранный язык в профессиональной сфере (пр.) преп. Пенькова О.В., ауд. 2-22" },
      { "number": 4, "text": "Поддержка и тестирование программных модулей (лаб.) преп. Юханаева Е.В., ауд. 1-36" }
    ],
    "1": [
      { "number": 1, "text": "Разработка и эксплуатация экономических информационных систем (л.) преп. Попова Н.Е., ауд. Актовый зал", "star": "*" },
      { "number": 2, "text": "Технология разработки и защиты баз данных (л.) преп. Донскова Д.А., ауд. Актовый зал" },
      { "number": 3, "text": "Стандартизация, сертификация и техническое документирование (л.) преп. Сидорова С.А., ауд. 3-02" }
    ],
    "3": [
      { "number": 3, "text": "Физическая культура (пр.) преп. Магомедов С.К., спортивный зал", "star": "**" },
      { "number": 4, "text": "Поддержка и тестирование программных модулей (л.) преп. Юханаева Е.В., ауд. 3-02" },
      { "number": 5, "text": "Технология разработки и защиты баз данных (л.) преп. Донскова Д.А., ауд. Актовый зал" }
    ],
    "4": [
      { "number": 1, "text": "Кураторский час преп. Саблина Е.Е., ауд. 2-14", "star": "*" },
      { "number": 3, "text": "Стандартизация, сертификация и техническое документирование (пр.) преп. Сидорова С.А., ауд. 3-12" },
      { "number": 4, "text": "Разработка и эксплуатация экономических информационных систем (л.) преп. Попова Н.Е., ауд. Актовый зал" },
      { "number": 5, "text": "Основы философии (л.) преп. Громова Е.А., ауд. Актовый зал" }
    ],
    "5": [
      { "number": 1, "text": "Технология разработки и защиты баз данных (лаб.) преп. Донскова Д.А., ауд. 1-02" },
      { "number": 2, "text": "Технология разработки и защиты баз данных (лаб.) преп. Донскова Д.А., ауд. 1-02" },
      { "number": 3, "text": "Разработка и эксплуатация экономических информационных систем (лаб.) преп. Попова Н.Е., ауд. 1-36" },
      { "number": 4, "text": "Разработка и эксплуатация экономических информационных систем (лаб.) преп. Попова Н.Е., ауд. 1-36", "star": "*" }
    ]
  },

  "ИСП-241": {
    "0": [
      { "number": 2, "text": "Разработка мобильных приложений (лаб.) преп. Леонтьев Д.А., ауд. 1-36" },
      { "number": 3, "text": "Разработка программных модулей (лаб.) преп. Донскова Д.А., ауд. 1-02" },
      { "number": 4, "text": "Разработка программных модулей (л.) преп. Донскова Д.А., ауд. 3-02" },
      { "number": 5, "text": "Внедрение и поддержка компьютерных систем (лаб.) преп. Ушакова М.А., ауд. 3-03" }
    ],
    "1": [
      { "number": 2, "text": "Системное программирование (лаб.) преп. Токаев Т.И., ауд. 1-36", "star": "**" },
      { "number": 3, "text": "Физическая культура (пр.) преп. Ерохина О.А., спортивный зал" },
      { "number": 4, "text": "Иностранный язык в профессиональной сфере (пр.) преп. Пенькова О.В., ауд. 2-22" },
      { "number": 5, "text": "Разработка программных модулей (лаб.) преп. Донскова Д.А., ауд. 3-03", "star": "*" },
      { "number": 5, "text": "Кураторский час преп. Саблина Е.Е., ауд. 2-17", "star": "**" }
    ],
    "2": [
      { "number": 2, "text": "Компьютерное 3D-моделирование (лаб.) преп. Леонтьев Д.А., ауд. 1-02" },
      { "number": 3, "text": "Системное программирование (лаб.) преп. Токаев Т.И., ауд. 3-03" },
      { "number": 4, "text": "Технология разработки программного обеспечения (л.) преп. Катунов Д.А., ауд. 2-20" }
    ],
    "3": [
      { "number": 1, "text": "Инструментальные средства разработки программного обеспечения (лаб.) преп. Леонтьев Д.А., ауд. 1-36", "star": "**" },
      { "number": 2, "text": "Внедрение и поддержка компьютерных систем (л.) преп. Ушакова М.А., ауд. Актовый зал", "star": "*" },
      { "number": 2, "text": "Компьютерное 3D-моделирование (лаб.) преп. Леонтьев Д.А., ауд. 1-02", "star": "**" },
      { "number": 3, "text": "Системное программирование (л.) преп. Токаев Т.И., ауд. Актовый зал" }
    ],
    "5": [
      { "number": 1, "text": "Инструментальные средства разработки программного обеспечения (лаб.) преп. Леонтьев Д.А., ауд. 3-03" },
      { "number": 2, "text": "Технология разработки программного обеспечения (лаб.) преп. Катунов Д.А., ауд. 3-09" }
    ]
  },

  "ИСП-242": {
    "0": [
      { "number": 2, "text": "Разработка программных модулей (лаб.) преп. Донскова Д.А., ауд. 3-03" },
      { "number": 3, "text": "Разработка мобильных приложений (лаб.) преп. Леонтьев Д.А., ауд. 1-36" },
      { "number": 4, "text": "Разработка программных модулей (л.) преп. Донскова Д.А., ауд. 3-02" }
    ],
    "1": [
      { "number": 2, "text": "Системное программирование (лаб.) преп. Токаев Т.И., ауд. 1-36", "star": "*" },
      { "number": 3, "text": "Иностранный язык в профессиональной сфере (пр.) преп. Пенькова О.В., ауд. 2-22" },
      { "number": 4, "text": "Физическая культура (пр.) преп. Ерохина О.А., спортивный зал" },
      { "number": 5, "text": "Разработка программных модулей (лаб.) преп. Донскова Д.А., ауд. 3-03", "star": "**" }
    ],
    "2": [
      { "number": 1, "text": "Системное программирование (лаб.) преп. Токаев Т.И., ауд. 3-03" },
      { "number": 2, "text": "Технология разработки программного обеспечения (лаб.) преп. Катунов Д.А., ауд. 3-12" },
      { "number": 3, "text": "Компьютерное 3D-моделирование (лаб.) преп. Леонтьев Д.А., ауд. 1-02" },
      { "number": 4, "text": "Технология разработки программного обеспечения (л.) преп. Катунов Д.А., ауд. 2-20" }
    ],
    "3": [
      { "number": 2, "text": "Внедрение и поддержка компьютерных систем (л.) преп. Ушакова М.А., ауд. Актовый зал", "star": "*" },
      { "number": 3, "text": "Системное программирование (л.) преп. Токаев Т.И., ауд. Актовый зал" },
      { "number": 4, "text": "Инструментальные средства разработки программного обеспечения (лаб.) преп. Леонтьев Д.А., ауд. 1-36", "star": "*" },
      { "number": 4, "text": "Компьютерное 3D-моделирование (лаб.) преп. Леонтьев Д.А., ауд. 1-36", "star": "**" },
      { "number": 5, "text": "Кураторский час преп. Пенькова О.В., ауд. 2-22", "star": "**" }
    ],
    "5": [
      { "number": 1, "text": "Внедрение и поддержка компьютерных систем (лаб.) преп. Ушакова М.А., ауд. 3-09" },
      { "number": 2, "text": "Инструментальные средства разработки программного обеспечения (лаб.) преп. Леонтьев Д.А., ауд. 3-03" }
    ]
  },

  "ИСП-233": {
    "0": [
      { "number": 3, "text": "Кураторский час преп. Чистоткина Е.С., ауд. 3-12", "star": "*" },
      { "number": 4, "text": "Иностранный язык в профессиональной сфере (пр.) преп. Пенькова О.В., ауд. 2-22" },
      { "number": 5, "text": "Технология разработки и защиты баз данных (лаб.) преп. Донскова Д.А., ауд. 1-02" }
    ],
    "1": [
      { "number": 1, "text": "Разработка и эксплуатация экономических информационных систем (л.) преп. Попова Н.Е., ауд. Актовый зал", "star": "*" },
      { "number": 2, "text": "Технология разработки и защиты баз данных (л.) преп. Донскова Д.А., ауд. Актовый зал" },
      { "number": 3, "text": "Стандартизация, сертификация и техническое документирование (л.) преп. Сидорова С.А., ауд. 3-02" },
      { "number": 4, "text": "Основы философии (пр.) преп. Громова Е.А., ауд. 3-02" }
    ],
    "3": [
      { "number": 2, "text": "Физическая культура (пр.) преп. Магомедов С.К., спортивный зал", "star": "**" },
      { "number": 3, "text": "Технология разработки и защиты баз данных (лаб.) преп. Донскова Д.А., ауд. 1-36" },
      { "number": 4, "text": "Поддержка и тестирование программных модулей (л.) преп. Юханаева Е.В., ауд. 3-02" },
      { "number": 5, "text": "Технология разработки и защиты баз данных (л.) преп. Донскова Д.А., ауд. Актовый зал" }
    ],
    "4": [
      { "number": 4, "text": "Разработка и эксплуатация экономических информационных систем (л.) преп. Попова Н.Е., ауд. Актовый зал" },
      { "number": 5, "text": "Основы философии (л.) преп. Громова Е.А., ауд. Актовый зал" }
    ],
    "5": [
      { "number": 1, "text": "Разработка и эксплуатация экономических информационных систем (лаб.) преп. Попова Н.Е., ауд. 1-36" },
      { "number": 2, "text": "Поддержка и тестирование программных модулей (лаб.) преп. Юханаева Е.В., ауд. 3-12" },
      { "number": 3, "text": "Стандартизация, сертификация и техническое документирование (пр.) преп. Сидорова С.А., ауд. 3-09" },
      { "number": 4, "text": "Разработка и эксплуатация экономических информационных систем (лаб.) преп. Попова Н.Е., ауд. 1-36", "star": "**" }
    ]
  },

  "ИСП-243": {
    "0": [
      { "number": 3, "text": "Кураторский час преп. Попова Н.Е., ауд. 3-12", "star": "**" },
      { "number": 4, "text": "Разработка программных модулей (л.) преп. Донскова Д.А., ауд. 3-02" },
      { "number": 5, "text": "Разработка мобильных приложений (лаб.) преп. Леонтьев Д.А., ауд. 1-36" }
    ],
    "1": [
      { "number": 1, "text": "Иностранный язык в профессиональной сфере (пр.) преп. Пенькова О.В., ауд. 2-22" },
      { "number": 2, "text": "Физическая культура (пр.) преп. Ерохина О.А., спортивный зал" },
      { "number": 3, "text": "Инструментальные средства разработки программного обеспечения (лаб.) преп. Леонтьев Д.А., ауд. 1-02", "star": "*" },
      { "number": 3, "text": "Компьютерное 3D-моделирование (лаб.) преп. Леонтьев Д.А., ауд. 1-02", "star": "**" },
      { "number": 4, "text": "Разработка программных модулей (лаб.) преп. Донскова Д.А., ауд. 1-36", "star": "**" }
    ],
    "2": [
      { "number": 2, "text": "Системное программирование (лаб.) преп. Токаев Т.И., ауд. 3-03" },
      { "number": 3, "text": "Технология разработки программного обеспечения (лаб.) преп. Катунов Д.А., ауд. 3-12" },
      { "number": 4, "text": "Технология разработки программного обеспечения (л.) преп. Катунов Д.А., ауд. 2-20" },
      { "number": 5, "text": "Внедрение и поддержка компьютерных систем (лаб.) преп. Ушакова М.А., ауд. 1-02" }
    ],
    "3": [
      { "number": 2, "text": "Внедрение и поддержка компьютерных систем (л.) преп. Ушакова М.А., ауд. Актовый зал", "star": "*" },
      { "number": 2, "text": "Системное программирование (лаб.) преп. Токаев Т.И., ауд. 1-36", "star": "**" },
      { "number": 3, "text": "Системное программирование (л.) преп. Токаев Т.И., ауд. Актовый зал" },
      { "number": 4, "text": "Разработка программных модулей (лаб.) преп. Донскова Д.А., ауд. 3-12" }
    ],
    "5": [
      { "number": 3, "text": "Инструментальные средства разработки программного обеспечения (лаб.) преп. Леонтьев Д.А., ауд. 3-03" },
      { "number": 4, "text": "Компьютерное 3D-моделирование (лаб.) преп. Леонтьев Д.А., ауд. 3-03" }
    ]
  },

  "ЗСП-262": {
    "0": [
      { "number": 1, "text": "География (пр.) преп. Доронин М.С., ауд. 3-30", "star": "*" },
      { "number": 1, "text": "Индивидуальный проект (пр.) 21.09.2026, 26.10.2026, 16.11.2026 преп. Юханаева Е.В., ауд. 3-02", "star": "**", "dates": ["2026-09-21", "2026-10-26", "2026-11-16"] },
      { "number": 2, "text": "Химия (л.) преп. Карпова Н.Н., ауд. 3-02" },
      { "number": 3, "text": "Математика (пр.) преп. Кизатова Н.А., ауд. 3-29" },
      { "number": 4, "text": "Кураторский час преп. Парфенова М.В., ауд. 2-13", "star": "**" }
    ],
    "1": [
      { "number": 1, "text": "Русский язык (пр.) преп. Саблина Е.Е., ауд. 2-13" },
      { "number": 2, "text": "Математика (л.) преп. Кизатова Н.А., ауд. 3-29" }
    ],
    "2": [
      { "number": 1, "text": "Математика (пр.) преп. Кизатова Н.А., ауд. 3-29" },
      { "number": 2, "text": "Химия (пр.) преп. Бондарук Е.А., ауд. 3-19", "star": "*" },
      { "number": 2, "text": "Литература (пр.) преп. Чистоткина Е.С., ауд. 3-20", "star": "**" },
      { "number": 3, "text": "Физика (л.) преп. Ушакова М.А., ауд. 3-02", "star": "*" },
      { "number": 3, "text": "Литература (л.) преп. Чистоткина Е.С., ауд. 3-02", "star": "**" },
      { "number": 4, "text": "Иностранный язык (пр.) преп. Пенькова О.В., ауд. 2-22" }
    ],
    "3": [
      { "number": 1, "text": "Информатика (пр.) преп. Исмаилова Ш.В., ауд. 3-09" },
      { "number": 2, "text": "Русский язык (л.) преп. Саблина Е.Е., ауд. 3-02", "star": "*" },
      { "number": 2, "text": "Информатика (л.) преп. Исмаилова Ш.В., ауд. Актовый зал", "star": "**" }
    ],
    "4": [
      { "number": 1, "text": "Физическая культура (пр.) преп. Ерохина О.А., ауд. Спортивный зал", "star": "*" },
      { "number": 1, "text": "История (пр.) преп. Мясникова О.Н., ауд. 3-19", "star": "**" },
      { "number": 2, "text": "История (л.) преп. Мясникова О.Н., ауд. Актовый зал" },
      { "number": 3, "text": "География (л.) преп. Доронин М.С., ауд. Актовый зал" },
      { "number": 4, "text": "Физика (пр.) преп. Ушакова М.А., ауд. 3-15", "star": "*" }
    ]
  },

  "ЗСП-231": {
    "0": [
      { "number": 1, "text": "Физическая культура (пр.) преп. Магомедов С.К., спортивный зал" },
      { "number": 2, "text": "Замерщик на топографо-геодезических и маркшейдерских работах (л.) преп. Грекова А.С., ауд. 3-20" },
      { "number": 3, "text": "Иностранный язык в профессиональной сфере (пр.) преп. Дубовикова Е.М., ауд. 2-17" },
      { "number": 4, "text": "Замерщик на топографо-геодезических и маркшейдерских работах (лаб.) преп. Грекова А.С., ауд. 1-02" }
    ],
    "1": [
      { "number": 2, "text": "Охрана окружающей среды и природоохранные мероприятия (л.) преп. Грекова А.С., ауд. 3-14", "star": "*" },
      { "number": 2, "text": "Основы экономики организации, менеджмента и маркетинга (л.) преп. Аблязова Н.Л., ауд. 3-14", "star": "**" },
      { "number": 3, "text": "Документационное обеспечение управления (пр.) преп. Чистоткина Е.С., ауд. 3-14" },
      { "number": 4, "text": "Выполнение комплекса работ в рамках мониторинга состояния земель (пр.) преп. Сухоносенко Д.С., ауд. 3-14" },
      { "number": 5, "text": "Документационное обеспечение управления (л.) преп. Чистоткина Е.С., ауд. 3-14" }
    ],
    "3": [
      { "number": 2, "text": "Замерщик на топографо-геодезических и маркшейдерских работах (лаб.) преп. Грекова А.С., ауд. 1-02", "star": "*" },
      { "number": 2, "text": "Замерщик на топографо-геодезических и маркшейдерских работах (л.) преп. Грекова А.С., ауд. 2-32", "star": "**" },
      { "number": 3, "text": "Основы экономики организации, менеджмента и маркетинга (л.) преп. Аблязова Н.Л., ауд. 2-31" },
      { "number": 4, "text": "Статистика (л.) преп. Удалова Н.Н., ауд. 3-19", "star": "*" },
      { "number": 4, "text": "Статистика (пр.) преп. Удалова Н.Н., ауд. 3-19", "star": "**" },
      { "number": 5, "text": "Основы экономики организации, менеджмента и маркетинга (пр.) преп. Аблязова Н.Л., ауд. 2-31", "star": "*" }
    ],
    "4": [
      { "number": 1, "text": "Охрана окружающей среды и природоохранные мероприятия (пр.) преп. Грекова А.С., ауд. 2-13" },
      { "number": 2, "text": "Основы экономики организации, менеджмента и маркетинга (пр.) преп. Аблязова Н.Л., ауд. 3-20" },
      { "number": 3, "text": "Кураторский час преп. Грекова А.С., ауд. 3-19", "star": "*" },
      { "number": 3, "text": "Выполнение комплекса работ в рамках мониторинга состояния земель (л.) преп. Сухоносенко Д.С., ауд. 3-19", "star": "**" }
    ]
  },

  "ЗСП-261": {
    "0": [
      { "number": 1, "text": "Индивидуальный проект (пр.) 21.09.2026, 26.10.2026, 16.11.2026 преп. Юханаева Е.В., ауд. 3-02", "star": "**", "dates": ["2026-09-21", "2026-10-26", "2026-11-16"] },
      { "number": 2, "text": "Химия (л.) преп. Карпова Н.Н., ауд. 3-02" },
      { "number": 3, "text": "Русский язык (пр.) преп. Саблина Е.Е., ауд. 3-19" }
    ],
    "1": [
      { "number": 2, "text": "Математика (л.) преп. Кизатова Н.А., ауд. 3-29" },
      { "number": 3, "text": "Математика (пр.) преп. Кизатова Н.А., ауд. 3-30" },
      { "number": 4, "text": "Информатика (пр.) преп. Исмаилова Ш.В., ауд. 3-12" }
    ],
    "2": [
      { "number": 1, "text": "Иностранный язык (пр.) преп. Пенькова О.В., ауд. 2-22" },
      { "number": 2, "text": "Литература (пр.) преп. Чистоткина Е.С., ауд. 3-20", "star": "*" },
      { "number": 2, "text": "Химия (пр.) преп. Бондарук Е.А., ауд. 3-19", "star": "**" },
      { "number": 3, "text": "Физика (л.) преп. Ушакова М.А., ауд. 3-02", "star": "*" },
      { "number": 3, "text": "Литература (л.) преп. Чистоткина Е.С., ауд. 3-02", "star": "**" }
    ],
    "3": [
      { "number": 1, "text": "География (пр.) преп. Доронин М.С., ауд. 3-27", "star": "*" },
      { "number": 2, "text": "Русский язык (л.) преп. Саблина Е.Е., ауд. 3-02", "star": "*" },
      { "number": 2, "text": "Информатика (л.) преп. Исмаилова Ш.В., ауд. Актовый зал", "star": "**" },
      { "number": 3, "text": "Физика (пр.) преп. Ушакова М.А., ауд. 3-30", "star": "**" },
      { "number": 4, "text": "Кураторский час преп. Кизатова Н.А., ауд. 2-14", "star": "**" }
    ],
    "4": [
      { "number": 1, "text": "История (пр.) преп. Мясникова О.Н., ауд. 3-19", "star": "*" },
      { "number": 1, "text": "Физическая культура (пр.) преп. Ерохина О.А., ауд. Спортивный зал", "star": "**" },
      { "number": 2, "text": "История (л.) преп. Мясникова О.Н., ауд. Актовый зал" },
      { "number": 3, "text": "География (л.) преп. Доронин М.С., ауд. Актовый зал" },
      { "number": 4, "text": "Математика (пр.) преп. Кизатова Н.А., ауд. 3-29" }
    ]
  },

  "ЗСП-241": {
    "0": [
      { "number": 2, "text": "Физическая культура (пр.) преп. Магомедов С.К., спортивный зал", "star": "**" },
      { "number": 3, "text": "Выполнение топографических съемок и оформление их результатов (л.) преп. Доронин М.С., ауд. 2-33" },
      { "number": 4, "text": "Выполнение топографических съемок и оформление их результатов (пр.) преп. Доронин М.С., ауд. 3-19" },
      { "number": 5, "text": "Кураторский час преп. Карпова Н.Н., ауд. 3-19", "star": "*" }
    ],
    "2": [
      { "number": 1, "text": "Основы геологии, геоморфологии, почвоведения (пр.) преп. Брызгалина Е.С., ауд. 2-23" },
      { "number": 2, "text": "Основы геологии, геоморфологии, почвоведения (л.) преп. Брызгалина Е.С., ауд. 2-23" }
    ],
    "3": [
      { "number": 2, "text": "Территориальное планирование (пр.) преп. Бондарук Е.А., ауд. 2-32", "star": "*" },
      { "number": 3, "text": "Выполнение топографических съемок и оформление их результатов (л.) преп. Доронин М.С., ауд. 2-17" },
      { "number": 4, "text": "Территориальное планирование (пр.) преп. Бондарук Е.А., ауд. 3-20" },
      { "number": 5, "text": "Территориальное планирование (л.) преп. Бондарук Е.А., ауд. 3-20" }
    ],
    "4": [
      { "number": 2, "text": "Выполнение топографических съемок и оформление их результатов (пр.) преп. Доронин М.С., ауд. 3-15" },
      { "number": 3, "text": "Иностранный язык в профессиональной сфере (пр.) преп. Пенькова О.В., ауд. 2-22" }
    ],
    "5": [
      { "number": 1, "text": "Основы ведения единого государственного реестра недвижимости (ЕГРН) (л.) преп. Кузьменко Т.Н., ауд. 2-14" },
      { "number": 2, "text": "Основы ведения единого государственного реестра недвижимости (ЕГРН) (пр.) преп. Кузьменко Т.Н., ауд. 2-14" }
    ]
  },

  "ЗСП-251": {
    "0": [
      { "number": 3, "text": "Статистика (пр.) преп. Удалова Н.Н., ауд. 3-20" },
      { "number": 4, "text": "Статистика (л.) преп. Удалова Н.Н., ауд. 3-27" },
      { "number": 5, "text": "Кураторский час преп. Карпова Н.Н., ауд. 3-19", "star": "**" }
    ],
    "1": [
      { "number": 2, "text": "Основы градостроительной деятельности (л.) преп. Удалова Н.Н., ауд. 3-27", "star": "*" },
      { "number": 3, "text": "Безопасность жизнедеятельности (л.) преп. Лобикова Е.С., ауд. 3-27" },
      { "number": 4, "text": "Безопасность жизнедеятельности (пр.) преп. Лобикова Е.С., ауд. 3-20", "star": "**" }
    ],
    "2": [
      { "number": 1, "text": "Основы геодезии и картографии, топографическая графика (пр.) преп. Бондарук Е.А., ауд. 3-19" },
      { "number": 2, "text": "Математические методы решения прикладных задач (л.) преп. Кизатова Н.А., ауд. 3-29" },
      { "number": 3, "text": "Здания и сооружения (пр.) преп. Удалова Н.Н., ауд. 3-20" },
      { "number": 4, "text": "Физическая культура (пр.) преп. Магомедов С.К., спортивный зал" }
    ],
    "3": [
      { "number": 2, "text": "Здания и сооружения (л.) преп. Удалова Н.Н., ауд. 3-27" },
      { "number": 3, "text": "Основы геодезии и картографии, топографическая графика (л.) преп. Бондарук Е.А., ауд. 3-02" },
      { "number": 4, "text": "Основы землеустройства (л.) преп. Чистоткина Е.С., ауд. 2-33" },
      { "number": 5, "text": "Основы землеустройства (пр.) преп. Чистоткина Е.С., ауд. 3-19" }
    ],
    "4": [
      { "number": 1, "text": "Иностранный язык в профессиональной сфере (пр.) преп. Пенькова О.В., ауд. 2-22" },
      { "number": 2, "text": "Математические методы решения прикладных задач (пр.) преп. Кизатова Н.А., ауд. 3-29" },
      { "number": 3, "text": "Основы градостроительной деятельности (пр.) преп. Удалова Н.Н., ауд. 3-20", "star": "*" }
    ]
  },

  "ЗСП-252": {
    "0": [
      { "number": 3, "text": "Физическая культура (пр.) преп. Магомедов С.К., спортивный зал" },
      { "number": 4, "text": "Статистика (л.) преп. Удалова Н.Н., ауд. 3-27" },
      { "number": 5, "text": "Статистика (пр.) преп. Удалова Н.Н., ауд. 3-20" }
    ],
    "1": [
      { "number": 2, "text": "Основы градостроительной деятельности (л.) преп. Удалова Н.Н., ауд. 3-27", "star": "*" },
      { "number": 3, "text": "Безопасность жизнедеятельности (л.) преп. Лобикова Е.С., ауд. 3-27" },
      { "number": 4, "text": "Безопасность жизнедеятельности (пр.) преп. Лобикова Е.С., ауд. 3-20", "star": "*" },
      { "number": 4, "text": "Кураторский час преп. Доронин М.С., ауд. 2-32", "star": "**" }
    ],
    "2": [
      { "number": 2, "text": "Математические методы решения прикладных задач (л.) преп. Кизатова Н.А., ауд. 3-29" },
      { "number": 3, "text": "Основы геодезии и картографии, топографическая графика (пр.) преп. Бондарук Е.А., ауд. 3-19" },
      { "number": 4, "text": "Здания и сооружения (пр.) преп. Удалова Н.Н., ауд. 3-20" },
      { "number": 5, "text": "Основы землеустройства (пр.) преп. Чистоткина Е.С., ауд. 3-20" }
    ],
    "3": [
      { "number": 2, "text": "Здания и сооружения (л.) преп. Удалова Н.Н., ауд. 3-27" },
      { "number": 3, "text": "Основы геодезии и картографии, топографическая графика (л.) преп. Бондарук Е.А., ауд. 3-02" },
      { "number": 4, "text": "Основы землеустройства (л.) преп. Чистоткина Е.С., ауд. 2-33" }
    ],
    "4": [
      { "number": 1, "text": "Математические методы решения прикладных задач (пр.) преп. Кизатова Н.А., ауд. 3-29" },
      { "number": 2, "text": "Иностранный язык в профессиональной сфере (пр.) преп. Пенькова О.В., ауд. 2-22" },
      { "number": 3, "text": "Основы градостроительной деятельности (пр.) преп. Удалова Н.Н., ауд. 3-20", "star": "**" }
    ]
  },

  "ЭСП-261": {
    "0": [
      { "number": 1, "text": "Обществознание (л.) преп. Чистоткина Е.С., ауд. 2-20", "star": "*" },
      { "number": 2, "text": "Информатика (л.) преп. Исмаилова Ш.В., ауд. 2-20", "star": "*" },
      { "number": 2, "text": "Информатика (пр.) преп. Исмаилова Ш.В., ауд. 3-09", "star": "**" },
      { "number": 3, "text": "Физика (пр.) преп. Ушакова М.А., ауд. 3-30", "star": "**" }
    ],
    "1": [
      { "number": 1, "text": "Математика (л.) преп. Гречкина О.В., ауд. 3-14" },
      { "number": 1, "text": "Физическая культура (пр.) преп. Ерохина О.А., ауд. Спортивный зал", "star": "*" },
      { "number": 1, "text": "История (пр.) преп. Мясникова О.Н., ауд. 3-27", "star": "**" },
      { "number": 2, "text": "Литература (л.) преп. Чистоткина Е.С., ауд. 2-20", "star": "*" },
      { "number": 2, "text": "Русский язык (л.) преп. Саблина Е.Е., ауд. 2-20", "star": "**" },
      { "number": 2, "text": "Иностранный язык (пр.) преп. Дубовикова Е.М., ауд. 2-17" },
      { "number": 3, "text": "Русский язык (пр.) преп. Саблина Е.Е., ауд. 2-14" },
      { "number": 3, "text": "Химия (л.) преп. Карпова Н.Н., ауд. 2-20" },
      { "number": 4, "text": "Литература (пр.) преп. Чистоткина Е.С., ауд. 3-27", "star": "*" },
      { "number": 4, "text": "Кураторский час преп. Сидорова С.А., ауд. 3-15", "star": "**" }
    ],
    "2": [
      { "number": 1, "text": "Обществознание (л.) преп. Чистоткина Е.С., ауд. 2-20" },
      { "number": 1, "text": "Основы безопасности и защиты Родины (пр.) преп. Шин А.Е., ауд. 2-13", "star": "*" },
      { "number": 1, "text": "Химия (пр.) преп. Бондарук Е.А., ауд. 3-18", "star": "**" },
      { "number": 2, "text": "Математика (пр.) преп. Гречкина О.В., ауд. 3-14" },
      { "number": 2, "text": "Основы безопасности и защиты Родины (л.) преп. Шин А.Е., ауд. 2-20" },
      { "number": 3, "text": "Обществознание (пр.) преп. Чистоткина Е.С., ауд. 3-15" },
      { "number": 3, "text": "Физика (л.) преп. Ушакова М.А., ауд. Актовый зал", "star": "**" },
      { "number": 4, "text": "История (л.) преп. Мясникова О.Н., ауд. 2-20" },
      { "number": 4, "text": "Индивидуальный проект (пр.) 26.09.2026, 24.10.2026, 21.11.2026 преп. Сидорова С.А., ауд. 2-20", "star": "**", "dates": ["2026-09-26", "2026-10-24", "2026-11-21"] }
    ]
  },

  "ЭСП-251": {
    "0": [
      { "number": 1, "text": "Финансовое право (л.) преп. Парфенова М.В., ауд. 2-13" },
      { "number": 2, "text": "Финансовое право (пр.) преп. Парфенова М.В., ауд. 2-13" },
      { "number": 3, "text": "Практические основы бухгалтерского учета активов организации и источников их формирования (л.) преп. Мишура Н.А., ауд. 2-13" },
      { "number": 4, "text": "Практические основы бухгалтерского учета активов организации и источников их формирования (пр.) преп. Мишура Н.А., ауд. 3-14", "subgroup": 2 }
    ],
    "1": [
      { "number": 1, "text": "Безопасность жизнедеятельности (л.) преп. Шин А.Е., ауд. 2-33" },
      { "number": 2, "text": "Экономика организации (пр.) преп. Удалова Н.Н., ауд. 3-18" },
      { "number": 3, "text": "Кураторский час преп. Грекова А.С., ауд. 3-20", "star": "*" },
      { "number": 3, "text": "Статистика (л.) преп. Удалова Н.Н., ауд. 3-20", "star": "**" },
      { "number": 3, "text": "Иностранный язык в профессиональной деятельности (пр.) преп. Дубовикова Е.М., ауд. 1-33" },
      { "number": 4, "text": "Экономика организации (л.) преп. Удалова Н.Н., ауд. 3-19" },
      { "number": 4, "text": "Менеджмент (пр.) преп. Запорожская С.А., ауд. 3-02" },
      { "number": 5, "text": "Основы бухгалтерского учета (пр.) преп. Мишура Н.А., ауд. 3-18" }
    ],
    "2": [
      { "number": 1, "text": "Финансовое право (л.) преп. Парфенова М.В., ауд. 2-13" },
      { "number": 1, "text": "Обучение служением (пр.) преп. Сидорова С.А., ауд. 2-33", "star": "*" },
      { "number": 1, "text": "Обучение служением (л.) преп. Сидорова С.А., ауд. 2-20", "star": "**" },
      { "number": 2, "text": "Менеджмент (пр.) преп. Запорожская С.А., ауд. 2-23" },
      { "number": 2, "text": "Физическая культура (пр.) преп. Ерохина О.А., спортивный зал" },
      { "number": 3, "text": "Основы бухгалтерского учета (л.) преп. Мишура Н.А., ауд. 3-27" },
      { "number": 3, "text": "Целеполагание и тайм-менеджмент (л.) преп. Громова Е.А., ауд. 2-13", "star": "*" },
      { "number": 3, "text": "Целеполагание и тайм-менеджмент (пр.) преп. Громова Е.А., ауд. 2-13", "star": "**" },
      { "number": 4, "text": "Практические основы бухгалтерского учета активов организации и источников их формирования (пр.) преп. Мишура Н.А., ауд. 3-27", "subgroup": 1 },
      { "number": 4, "text": "Статистика (пр.) преп. Удалова Н.Н., ауд. 3-18", "star": "*" }
    ]
  },

  "ЭСП-241": {
    "0": [
      { "number": 1, "text": "Технология составления бухгалтерской отчетности (лаб.) преп. Грекова А.С., ауд. 1-02", "subgroup": 2 },
      { "number": 2, "text": "Практические основы налогового учета (лаб.) преп. Сидорова С.А., ауд. 1- 02", "subgroup": 2 },
      { "number": 3, "text": "Организация расчетов с бюджетами бюджетной системы РФ (л.) преп. Аблязова Н.Л., ауд. 2-14" },
      { "number": 4, "text": "Иностранный язык в профессиональной деятельности (пр.) преп. Дубовикова Е.М., ауд. 2-17" },
      { "number": 5, "text": "Кураторский час преп. Парфенова М.В., ауд. 3-02", "star": "**" }
    ],
    "1": [
      { "number": 1, "text": "Технология составления бухгалтерской отчетности (л.) преп. Грекова А.С., ауд. 1-02" },
      { "number": 1, "text": "Практические основы налогового учета (лаб.) преп. Сидорова С.А., ауд. 1-02", "subgroup": 1 },
      { "number": 2, "text": "Выполнение работ по профессии кассир (л.) преп. Леонова Н.А., ауд. 2-33" },
      { "number": 2, "text": "Практические основы налогового учета (л.) преп. Сидорова С.А., ауд. 2-23" },
      { "number": 3, "text": "Выполнение работ по профессии кассир (пр.) преп. Леонова Н.А., ауд. 2-33" },
      { "number": 3, "text": "Технология составления бухгалтерской отчетности (л.) преп. Грекова А.С., ауд. 2-23" },
      { "number": 4, "text": "Выполнение работ по профессии кассир (пр.) преп. Леонова Н.А., ауд. 2-33" },
      { "number": 4, "text": "Лабораторный практикум по составлению и использованию бухгалтерской (финансовой) и налоговой отчетности (лаб.) преп. Грекова А.С., ауд. 1-02", "subgroup": 1 }
    ],
    "2": [
      { "number": 1, "text": "Лабораторный практикум по составлению и использованию бухгалтерской (финансовой) и налоговой отчетности (лаб.) преп. Грекова А.С., ауд. 1-02", "subgroup": 1 },
      { "number": 1, "text": "Технология составления бухгалтерской отчетности (лаб.) преп. Грекова А.С., ауд. 1-02", "subgroup": 2 },
      { "number": 2, "text": "Физическая культура (пр.) преп. Ерохина О.А., спортивный зал" },
      { "number": 2, "text": "Экономическая политика (л.) 11.09.2026, 18.09.2026, 16.10.2026, 23.10.2026 преп. Логинова Е.В., ауд. 2-20 Экономическая политика (пр.) 25.09.2026, 30.10.2026 преп. Логинова Е.В., ауд. 2-20", "dates": ["2026-09-11", "2026-09-18", "2026-10-16", "2026-10-23", "2026-09-25", "2026-10-30"] },
      { "number": 3, "text": "Организация расчетов с бюджетами бюджетной системы РФ (лаб.) преп. Аблязова Н.Л., ауд. 3-27", "subgroup": 1 },
      { "number": 3, "text": "Лабораторный практикум по составлению и использованию бухгалтерской (финансовой) и налоговой отчетности (лаб.) преп. Грекова А.С., ауд. 1-02", "subgroup": 2 },
      { "number": 4, "text": "Практические основы налогового учета (лаб.) преп. Сидорова С.А., ауд. 1-02", "subgroup": 1 },
      { "number": 4, "text": "Лабораторный практикум по составлению и использованию бухгалтерской (финансовой) и налоговой отчетности (лаб.) преп. Грекова А.С., ауд. 1-02", "subgroup": 2 },
      { "number": 4, "text": "Организация расчетов с бюджетами бюджетной системы РФ (лаб.) преп. Аблязова Н.Л., ауд. 2- 14", "subgroup": 2 },
      { "number": 5, "text": "Практические основы налогового учета (лаб.) преп. Сидорова С.А., ауд. 1- 02", "subgroup": 2 }
    ]
  },

  "ЮСП-261": {
    "0": [
      { "number": 1, "text": "Обществознание (л.) преп. Чистоткина Е.С., ауд. 2-20", "star": "*" },
      { "number": 1, "text": "Иностранный язык (пр.) преп. Дубовикова Е.М., ауд. 2-17", "star": "**" },
      { "number": 2, "text": "Информатика (л.) преп. Исмаилова Ш.В., ауд. 2-20", "star": "*" },
      { "number": 2, "text": "Иностранный язык (пр.) преп. Дубовикова Е.М., ауд. 2-17", "star": "**" }
    ],
    "1": [
      { "number": 1, "text": "Литература (пр.) преп. Чистоткина Е.С., ауд. 3-19", "star": "*" },
      { "number": 1, "text": "Основы безопасности и защиты Родины (пр.) преп. Шин А.Е., ауд. 3-20", "star": "**" },
      { "number": 2, "text": "Литература (л.) преп. Чистоткина Е.С., ауд. 2-20", "star": "*" },
      { "number": 2, "text": "Русский язык (л.) преп. Саблина Е.Е., ауд. 2-20", "star": "**" },
      { "number": 3, "text": "Кураторский час преп. Исмаилова Ш.В., ауд. 3-19", "star": "*" }
    ],
    "2": [
      { "number": 1, "text": "Обществознание (пр.) преп. Чистоткина Е.С., ауд. 3-20" },
      { "number": 2, "text": "История (пр.) преп. Мясникова О.Н., ауд. 3-27", "star": "*" },
      { "number": 2, "text": "Физическая культура (пр.) преп. Магомедов С.К., спортивный зал", "star": "**" },
      { "number": 3, "text": "Химия (л.) преп. Карпова Н.Н., ауд. 2-20" },
      { "number": 4, "text": "Русский язык (пр.) преп. Саблина Е.Е., ауд. 3-15" }
    ],
    "3": [
      { "number": 1, "text": "Математика (пр.) преп. Абрамов Е.В., ауд. 3-29" },
      { "number": 2, "text": "Математика (л.) преп. Абрамов Е.В., ауд. 3-29" },
      { "number": 3, "text": "Физика (пр.) преп. Ушакова М.А., ауд. 3-30", "star": "*" },
      { "number": 3, "text": "Информатика (пр.) преп. Исмаилова Ш.В., ауд. 3-09", "star": "**" },
      { "number": 4, "text": "История (л.) преп. Мясникова О.Н., ауд. 2-20" }
    ],
    "5": [
      { "number": 1, "text": "Химия (пр.) преп. Бондарук Е.А., ауд. 3-18", "star": "*" },
      { "number": 2, "text": "Основы безопасности и защиты Родины (л.) преп. Шин А.Е., ауд. 2-20" },
      { "number": 3, "text": "Физика (л.) преп. Ушакова М.А., ауд. Актовый зал", "star": "**" },
      { "number": 4, "text": "Индивидуальный проект (пр.) 26.09.2026, 24.10.2026, 21.11.2026 преп. Сидорова С.А., ауд. 2-20", "star": "**", "dates": ["2026-09-26", "2026-10-24", "2026-11-21"] }
    ]
  },

  "ЮСП-262": {
    "0": [
      { "number": 1, "text": "Обществознание (л.) преп. Чистоткина Е.С., ауд. 2-20", "star": "*" },
      { "number": 2, "text": "Информатика (л.) преп. Исмаилова Ш.В., ауд. 2-20", "star": "*" },
      { "number": 3, "text": "Физика (пр.) преп. Ушакова М.А., ауд. 3-30", "star": "*" }
    ],
    "1": [
      { "number": 1, "text": "Информатика (пр.) преп. Исмаилова Ш.В., ауд. 3-09", "star": "*" },
      { "number": 1, "text": "Литература (пр.) преп. Чистоткина Е.С., ауд. 3-19", "star": "**" },
      { "number": 2, "text": "Литература (л.) преп. Чистоткина Е.С., ауд. 2-20", "star": "*" },
      { "number": 2, "text": "Русский язык (л.) преп. Саблина Е.Е., ауд. 2-20", "star": "**" },
      { "number": 3, "text": "Кураторский час преп. Аблязова Н.Л., ауд. 3-19", "star": "**" }
    ],
    "2": [
      { "number": 1, "text": "Русский язык (пр.) преп. Саблина Е.Е., ауд. 2-14" },
      { "number": 2, "text": "Физическая культура (пр.) преп. Магомедов С.К., спортивный зал", "star": "*" },
      { "number": 2, "text": "История (пр.) преп. Мясникова О.Н., ауд. 3-27", "star": "**" },
      { "number": 3, "text": "Химия (л.) преп. Карпова Н.Н., ауд. 2-20" },
      { "number": 4, "text": "Иностранный язык (пр.) преп. Дубовикова Е.М., ауд. 2-17" }
    ],
    "3": [
      { "number": 1, "text": "Обществознание (пр.) преп. Чистоткина Е.С., ауд. 3-20" },
      { "number": 2, "text": "Математика (л.) преп. Абрамов Е.В., ауд. 3-29" },
      { "number": 3, "text": "Математика (пр.) преп. Абрамов Е.В., ауд. 3-29" },
      { "number": 4, "text": "История (л.) преп. Мясникова О.Н., ауд. 2-20" }
    ],
    "5": [
      { "number": 1, "text": "Основы безопасности и защиты Родины (пр.) преп. Шин А.Е., ауд. 2-13", "star": "**" },
      { "number": 2, "text": "Основы безопасности и защиты Родины (л.) преп. Шин А.Е., ауд. 2-20" },
      { "number": 3, "text": "Химия (пр.) преп. Бондарук Е.А., ауд. 3-19", "star": "*" },
      { "number": 3, "text": "Физика (л.) преп. Ушакова М.А., ауд. Актовый зал", "star": "**" },
      { "number": 4, "text": "Индивидуальный проект (пр.) 26.09.2026, 24.10.2026, 21.11.2026 преп. Сидорова С.А., ауд. 2-20", "star": "**", "dates": ["2026-09-26", "2026-10-24", "2026-11-21"] }
    ]
  },

  "ЮСП-252": {
    "0": [
      { "number": 1, "text": "Информационные технологии в юридической деятельности (пр.) преп. Исмаилова Ш.В., ауд. 3-12" },
      { "number": 2, "text": "Теория государства и права (л.) преп. Аблязова Н.Л., ауд. Актовый зал" }
    ],
    "1": [
      { "number": 1, "text": "Обучение служением (пр.) преп. Аблязова Н.Л., ауд. 3-20", "star": "*" },
      { "number": 1, "text": "Информационные технологии в юридической деятельности (л.) преп. Исмаилова Ш.В., ауд. Актовый зал", "star": "**" },
      { "number": 2, "text": "Судоустройство и правоохранительные органы (пр.) преп. Рубцов В.В., ауд. 2-17" },
      { "number": 3, "text": "Физическая культура (пр.) преп. Магомедов С.К., спортивный зал" },
      { "number": 4, "text": "Конституционное право России (пр.) преп. Фомиченко Ю.А., ауд. 2-13" }
    ],
    "2": [
      { "number": 1, "text": "Судоустройство и правоохранительные органы (л.) преп. Рубцов В.В., ауд. 2-20" },
      { "number": 2, "text": "Документационное обеспечение управления (пр.) преп. Саблина Е.Е., ауд. 3-15" },
      { "number": 3, "text": "Теория государства и права (пр.) преп. Аблязова Н.Л., ауд. 2-14" },
      { "number": 4, "text": "Кураторский час преп. Абабий М.В., ауд. 1-33", "star": "**" }
    ],
    "3": [
      { "number": 3, "text": "Конституционное право России (л.) преп. Фомиченко Ю.А., ауд. 2-20" },
      { "number": 4, "text": "Документационное обеспечение управления (л.) преп. Саблина Е.Е., ауд. Актовый зал" },
      { "number": 5, "text": "Безопасность жизнедеятельности (пр.) преп. Филатова И.Г., ауд. 2-20" }
    ],
    "4": [
      { "number": 1, "text": "Информационные технологии в юридической деятельности (пр.) преп. Исмаилова Ш.В., ауд. 3-12" },
      { "number": 1, "text": "Обучение служением (л.) преп. Сидорова С.А., ауд. 2-20" },
      { "number": 2, "text": "Безопасность жизнедеятельности (пр.) преп. Филатова И.Г., ауд. 3-18" },
      { "number": 3, "text": "Иностранный язык в профессиональной деятельности (пр.) преп. Дубовикова Е.М., ауд. 2-17" }
    ]
  },

  "ЮСП-253": {
    "0": [
      { "number": 1, "text": "Основы профессиональной деятельности юриста (пр.) преп. Сидорова С.А., ауд. 3-03" },
      { "number": 2, "text": "Основы управления в правоохранительных органах (пр.) преп. Наход Т.В., ауд. 3-15" },
      { "number": 3, "text": "Основы профессиональной деятельности юриста (пр.) преп. Сидорова С.А., ауд. 3-03" },
      { "number": 3, "text": "Основы управления в правоохранительных органах (пр.) преп. Наход Т.В., ауд. 3-15" },
      { "number": 4, "text": "Основы управления в правоохранительных органах (пр.) преп. Наход Т.В., ауд. 3-15" },
      { "number": 4, "text": "Основы профессиональной деятельности юриста (пр.) преп. Сидорова С.А., ауд. 3-03" }
    ],
    "1": [
      { "number": 1, "text": "Гражданское право (пр.) преп. Заиченко Ю.Ю., ауд. 3-18" },
      { "number": 1, "text": "Гражданский процесс (пр.) преп. Фомиченко Ю.А., ауд. 2-14", "star": "**" },
      { "number": 2, "text": "Уголовное право (пр.) преп. Шин А.Е., ауд. 3-19" },
      { "number": 2, "text": "Административный процесс (пр.) преп. Мишура Н.А., ауд. 3-02" },
      { "number": 3, "text": "Административный процесс (пр.) преп. Мишура Н.А., ауд. 3-15" },
      { "number": 3, "text": "Гражданский процесс (пр.) преп. Фомиченко Ю.А., ауд. 2-13" },
      { "number": 4, "text": "Административный процесс (л.) преп. Мишура Н.А., ауд. Актовый зал" },
      { "number": 5, "text": "Основы профессиональной деятельности юриста (л.) преп. Сидорова С.А., ауд. 2-20", "star": "*" }
    ],
    "2": [
      { "number": 1, "text": "Гражданский процесс (л.) преп. Фомиченко Ю.А., ауд. Актовый зал" },
      { "number": 2, "text": "Уголовное право (л.) преп. Шин А.Е., ауд. Актовый зал" },
      { "number": 3, "text": "Гражданский процесс (пр.) преп. Фомиченко Ю.А., ауд. 3-18" },
      { "number": 3, "text": "Уголовное право (пр.) преп. Шин А.Е., ауд. 3-27" },
      { "number": 4, "text": "Гражданский процесс (пр.) преп. Фомиченко Ю.А., ауд. 3-27", "star": "*" },
      { "number": 4, "text": "Экономическая политика (пр.) 23.09.2026, 28.10.2026 преп. Логинова Е.В., ауд. 2-13", "dates": ["2026-09-23", "2026-10-28"] },
      { "number": 4, "text": "Кураторский час преп. Фомиченко Ю.А., ауд. 3-27", "star": "**" }
    ],
    "3": [
      { "number": 1, "text": "Финансовое право (пр.) преп. Парфенова М.В., ауд. 2-23", "star": "*" },
      { "number": 2, "text": "Финансовое право (л.) преп. Парфенова М.В., ауд. 2-20", "star": "*" },
      { "number": 3, "text": "Финансовое право (пр.) преп. Парфенова М.В., ауд. 2-32", "star": "*" },
      { "number": 3, "text": "Гражданское право (пр.) преп. Заиченко Ю.Ю., ауд. 2-32", "star": "**" },
      { "number": 4, "text": "Кураторский час преп. Филатова И.Г., ауд. 2-14", "star": "*" },
      { "number": 4, "text": "Гражданское право (пр.) преп. Заиченко Ю.Ю., ауд. 2-32", "star": "**" }
    ],
    "4": [
      { "number": 1, "text": "Экономическая политика (пр.) 25.09.2026, 30.10.2026 преп. Логинова Е.В., ауд. 3-27", "dates": ["2026-09-25", "2026-10-30"] },
      { "number": 1, "text": "Основы профессиональной деятельности юриста (пр.) преп. Сидорова С.А., ауд. 3-03" },
      { "number": 2, "text": "Экономическая политика (л.) 11.09.2026, 18.09.2026, 16.10.2026, 23.10.2026 преп. Логинова Е.В., ауд. 2-20", "dates": ["2026-09-11", "2026-09-18", "2026-10-16", "2026-10-23"] },
      { "number": 3, "text": "Основы управления в правоохранительных органах (л.) преп. Наход Т.В., ауд. 2-20" },
      { "number": 4, "text": "Гражданское право (л.) преп. Заиченко Ю.Ю., ауд. 2-20" }
    ],
    "5": [
      { "number": 1, "text": "Муниципальное право (пр.) преп. Изингер Н.В., ауд. Актовый зал" },
      { "number": 2, "text": "Муниципальное право (л.) преп. Изингер Н.В., ауд. Актовый зал" },
      { "number": 3, "text": "Муниципальное право (пр.) преп. Изингер Н.В., ауд. 2-33" }
    ]
  },

  "ЮСП-263": {
    "0": [
      { "number": 1, "text": "Кураторский час преп. Фомиченко Ю.А., ауд. 2-14", "star": "**" },
      { "number": 2, "text": "Теория государства и права (л.) преп. Аблязова Н.Л., ауд. Актовый зал" },
      { "number": 3, "text": "Конституционное право России (пр.) преп. Фомиченко Ю.А., ауд. 2-23" },
      { "number": 4, "text": "Документационное обеспечение управления (пр.) преп. Саблина Е.Е., ауд. 3-30" }
    ],
    "1": [
      { "number": 1, "text": "Информационные технологии в юридической деятельности (л.) преп. Исмаилова Ш.В., ауд. Актовый зал", "star": "**" },
      { "number": 2, "text": "Информационные технологии в юридической деятельности (пр.) преп. Исмаилова Ш.В., ауд. 3-12" },
      { "number": 3, "text": "Судоустройство и правоохранительные органы (пр.) преп. Рубцов В.В., ауд. 3-29" },
      { "number": 4, "text": "Физическая культура (пр.) преп. Магомедов С.К., спортивный зал" }
    ],
    "2": [
      { "number": 1, "text": "Судоустройство и правоохранительные органы (л.) преп. Рубцов В.В., ауд. 2-20" },
      { "number": 2, "text": "Теория государства и права (пр.) преп. Аблязова Н.Л., ауд. 2-14" },
      { "number": 3, "text": "Обучение служением (пр.) преп. Юханаева Е.В., ауд. 3-29", "star": "**" }
    ],
    "3": [
      { "number": 3, "text": "Конституционное право России (л.) преп. Фомиченко Ю.А., ауд. 2-20" },
      { "number": 4, "text": "Документационное обеспечение управления (л.) преп. Саблина Е.Е., ауд. Актовый зал" },
      { "number": 5, "text": "Безопасность жизнедеятельности (пр.) преп. Филатова И.Г., ауд. 2-20" }
    ],
    "4": [
      { "number": 1, "text": "Информационные технологии в юридической деятельности (пр.) преп. Исмаилова Ш.В., ауд. 3-12" },
      { "number": 1, "text": "Обучение служением (л.) преп. Сидорова С.А., ауд. 2-20" },
      { "number": 2, "text": "Иностранный язык в профессиональной деятельности (пр.) преп. Дубовикова Е.М., ауд. 2-17" },
      { "number": 3, "text": "Безопасность жизнедеятельности (пр.) преп. Филатова И.Г., ауд. 3-15" }
    ]
  },

  "ЮСП-251": {
    "0": [
      { "number": 2, "text": "Теория государства и права (л.) преп. Аблязова Н.Л., ауд. Актовый зал" },
      { "number": 3, "text": "Информационные технологии в юридической деятельности (пр.) преп. Исмаилова Ш.В., ауд. 3-09" },
      { "number": 4, "text": "Безопасность жизнедеятельности (пр.) преп. Филатова И.Г., ауд. 2-32" }
    ],
    "1": [
      { "number": 1, "text": "Информационные технологии в юридической деятельности (л.) преп. Исмаилова Ш.В., ауд. Актовый зал", "star": "**" },
      { "number": 2, "text": "Обучение служением (пр.) (четыре пары) преп. Юханаева Е.В., ауд. 3-27", "star": "**" }
    ],
    "2": [
      { "number": 1, "text": "Судоустройство и правоохранительные органы (л.) преп. Рубцов В.В., ауд. 2-20" },
      { "number": 2, "text": "Судоустройство и правоохранительные органы (пр.) преп. Рубцов В.В., ауд. 3-30" },
      { "number": 3, "text": "Физическая культура (пр.) преп. Магомедов С.К., спортивный зал" },
      { "number": 4, "text": "Теория государства и права (пр.) преп. Аблязова Н.Л., ауд. 3-19" }
    ],
    "3": [
      { "number": 2, "text": "Обучение служением (пр.) (три пары) преп. Аблязова Н.Л., ауд. 1-33", "star": "*" },
      { "number": 2, "text": "Кураторский час преп. Абабий М.В., ауд. 1-01", "star": "**" },
      { "number": 3, "text": "Конституционное право России (л.) преп. Фомиченко Ю.А., ауд. 2-20" },
      { "number": 4, "text": "Документационное обеспечение управления (л.) преп. Саблина Е.Е., ауд. Актовый зал" },
      { "number": 5, "text": "Безопасность жизнедеятельности (пр.) преп. Филатова И.Г., ауд. 2-20" }
    ],
    "4": [
      { "number": 1, "text": "Информационные технологии в юридической деятельности (пр.) преп. Исмаилова Ш.В., ауд. 3-12" },
      { "number": 1, "text": "Обучение служением (л.) преп. Сидорова С.А., ауд. 2-20" },
      { "number": 2, "text": "Документационное обеспечение управления (пр.) преп. Саблина Е.Е., ауд. 2-14" },
      { "number": 3, "text": "Конституционное право России (пр.) преп. Фомиченко Ю.А., ауд. 2-14" },
      { "number": 4, "text": "Иностранный язык в профессиональной деятельности (пр.) преп. Дубовикова Е.М., ауд. 2-17" }
    ]
  },

  "ЮСП-241": {
    "0": [
      { "number": 3, "text": "Основы профессиональной деятельности юриста (пр.) преп. Сидорова С.А., ауд. 3-03" },
      { "number": 4, "text": "Основы управления в правоохранительных органах (пр.) преп. Наход Т.В., ауд. 3-15" }
    ],
    "1": [
      { "number": 1, "text": "Гражданское право (пр.) преп. Заиченко Ю.Ю., ауд. 3-18" },
      { "number": 2, "text": "Уголовное право (пр.) преп. Шин А.Е., ауд. 3-19" },
      { "number": 3, "text": "Административный процесс (пр.) преп. Мишура Н.А., ауд. 3-15" },
      { "number": 4, "text": "Административный процесс (л.) преп. Мишура Н.А., ауд. Актовый зал" },
      { "number": 5, "text": "Основы профессиональной деятельности юриста (л.) преп. Сидорова С.А., ауд. 2-20", "star": "*" }
    ],
    "2": [
      { "number": 1, "text": "Гражданский процесс (л.) преп. Фомиченко Ю.А., ауд. Актовый зал" },
      { "number": 2, "text": "Уголовное право (л.) преп. Шин А.Е., ауд. Актовый зал" },
      { "number": 3, "text": "Гражданский процесс (пр.) преп. Фомиченко Ю.А., ауд. 3-18" },
      { "number": 4, "text": "Гражданский процесс (пр.) преп. Фомиченко Ю.А., ауд. 3-27", "star": "*" },
      { "number": 4, "text": "Кураторский час преп. Фомиченко Ю.А., ауд. 3-27", "star": "**" }
    ],
    "3": [
      { "number": 1, "text": "Гражданское право (пр.) преп. Заиченко Ю.Ю., ауд. 3-02", "star": "**" },
      { "number": 1, "text": "Финансовое право (пр.) преп. Парфенова М.В., ауд. 2-23", "star": "*" },
      { "number": 2, "text": "Гражданское право (пр.) преп. Заиченко Ю.Ю., ауд. 1-33", "star": "**" },
      { "number": 2, "text": "Финансовое право (л.) преп. Парфенова М.В., ауд. 2-20", "star": "*" }
    ],
    "4": [
      { "number": 1, "text": "Экономическая политика (пр.) 25.09.2026, 30.10.2026 преп. Логинова Е.В., ауд. 3-27", "dates": ["2026-09-25", "2026-10-30"] },
      { "number": 2, "text": "Экономическая политика (л.) 11.09.2026, 18.09.2026, 16.10.2026, 23.10.2026 преп. Логинова Е.В., ауд. 2-20", "dates": ["2026-09-11", "2026-09-18", "2026-10-16", "2026-10-23"] },
      { "number": 3, "text": "Основы управления в правоохранительных органах (л.) преп. Наход Т.В., ауд. 2-20" },
      { "number": 4, "text": "Гражданское право (л.) преп. Заиченко Ю.Ю., ауд. 2-20" }
    ],
    "5": [
      { "number": 1, "text": "Муниципальное право (пр.) преп. Изингер Н.В., ауд. Актовый зал" },
      { "number": 2, "text": "Муниципальное право (л.) преп. Изингер Н.В., ауд. Актовый зал" }
    ]
  },

  "ЮСП-242": {
    "0": [
      { "number": 3, "text": "Основы управления в правоохранительных органах (пр.) преп. Наход Т.В., ауд. 3-15" },
      { "number": 4, "text": "Основы профессиональной деятельности юриста (пр.) преп. Сидорова С.А., ауд. 3-03" }
    ],
    "1": [
      { "number": 1, "text": "Гражданский процесс (пр.) преп. Фомиченко Ю.А., ауд. 2-14", "star": "**" },
      { "number": 2, "text": "Административный процесс (пр.) преп. Мишура Н.А., ауд. 3-02" },
      { "number": 3, "text": "Гражданский процесс (пр.) преп. Фомиченко Ю.А., ауд. 2-13" },
      { "number": 4, "text": "Административный процесс (л.) преп. Мишура Н.А., ауд. Актовый зал" },
      { "number": 5, "text": "Основы профессиональной деятельности юриста (л.) преп. Сидорова С.А., ауд. 2-20", "star": "*" }
    ],
    "2": [
      { "number": 1, "text": "Гражданский процесс (л.) преп. Фомиченко Ю.А., ауд. Актовый зал" },
      { "number": 2, "text": "Уголовное право (л.) преп. Шин А.Е., ауд. Актовый зал" },
      { "number": 3, "text": "Уголовное право (пр.) преп. Шин А.Е., ауд. 3-27" },
      { "number": 4, "text": "Экономическая политика (пр.) 23.09.2026, 28.10.2026 преп. Логинова Е.В., ауд. 2-13", "dates": ["2026-09-23", "2026-10-28"] }
    ],
    "3": [
      { "number": 2, "text": "Финансовое право (л.) преп. Парфенова М.В., ауд. 2-20", "star": "*" },
      { "number": 3, "text": "Финансовое право (пр.) преп. Парфенова М.В., ауд. 2-32", "star": "*" },
      { "number": 3, "text": "Гражданское право (пр.) преп. Заиченко Ю.Ю., ауд. 2-32", "star": "**" },
      { "number": 4, "text": "Кураторский час преп. Филатова И.Г., ауд. 2-14", "star": "*" },
      { "number": 4, "text": "Гражданское право (пр.) преп. Заиченко Ю.Ю., ауд. 2-32", "star": "**" },
      { "number": 2, "text": "Гражданский процесс (пр.) преп. Фомиченко Ю.А., ауд. 2-20", "star": "**" }
    ],
    "4": [
      { "number": 2, "text": "Экономическая политика (л.) 11.09.2026, 18.09.2026, 16.10.2026, 23.10.2026 преп. Логинова Е.В., ауд. 2-20", "dates": ["2026-09-11", "2026-09-18", "2026-10-16", "2026-10-23"] },
      { "number": 3, "text": "Основы управления в правоохранительных органах (л.) преп. Наход Т.В., ауд. 2-20" },
      { "number": 4, "text": "Гражданское право (л.) преп. Заиченко Ю.Ю., ауд. 2-20" }
    ],
    "5": [
      { "number": 2, "text": "Муниципальное право (л.) преп. Изингер Н.В., ауд. Актовый зал" },
      { "number": 3, "text": "Муниципальное право (пр.) преп. Изингер Н.В., ауд. 2-33" }
    ]
  }
};
